import {
  expressBanner,
  groupBanner,
  individualBanner,
  loveStoryBanner,
  servicesExpress,
  servicesGroup,
  servicesIndividual,
  servicesLoveStory,
} from '@/assets';

const serviceDetails = {
  individual: {
    name: 'Індивідуальна зйомка',
    value: 'individual',
    bannerPhoto: individualBanner,
    bannerPhotoMobile: servicesIndividual,
    details: {
      price: '1500 грн',
      duration: '1 год',
      photosCount: '60-70 фотографій',
      deliveryTime: 'до 10 днів',
    },
    description:
      'Індивідуальна зйомка — це персональна історія в кадрі.\nВона підлаштована під тебе: твої ідеї, емоції та настрій.\nРазом ми обираємо концепцію, локацію та образи.\nЗйомка проходить у комфортній атмосфері, без тиску, щоб кожен кадр був щирим і природним.\nЦей формат підходить для тих, хто хоче розкритися перед камерою, зберегти важливий період у житті або просто зробити естетичні фото для себе.',
  },
  'love-story': {
    name: 'Love Story',
    value: 'loveStory',
    bannerPhoto: loveStoryBanner,
    bannerPhotoMobile: servicesLoveStory,
    details: {
      price: '2000 грн',
      duration: '1 год',
      photosCount: '60-70 фото',
      deliveryTime: 'до 10 днів',
    },
    description:
      'Love Story — це серія фотозйомок, що відображають справжні історії кохання.\nЦе не просто фотографії, а живі моменти, які розповідають про почуття, близькість і важливі події у житті пари — від першої зустрічі до заручин або весілля.\nЦя категорія створена для тих, хто хоче зберегти свої найцінніші емоції у красивих, природних кадрах.',
  },
  express: {
    name: 'Експрес зйомка',
    value: 'express',
    bannerPhoto: expressBanner,
    bannerPhotoMobile: servicesExpress,
    details: {
      price: '1000 грн',
      duration: '30 хв',
      photosCount: '30-40 фото',
      deliveryTime: 'до 10 днів',
    },
    description:
      'Це формат індивідуальної фотосесії, який триває приблизно 30 хвилин замість стандартної години.\nІдеально підходить, коли час обмежений, але хочеться отримати стильні та якісні фото швидко і без зайвих витрат.\nХоча тривалість зйомки коротша, я ретельно підходжу до кожного кадру, щоб у підсумку ви отримали кілька яскравих, природних і виразних світлин.\nЦя категорія — чудовий вибір для оновлення портфоліо, фото для соцмереж або подарунка близьким.',
  },
  group: {
    name: 'Групова зйомка',
    value: 'group',
    bannerPhoto: groupBanner,
    bannerPhotoMobile: servicesGroup,
    details: {
      price: '3000 грн',
      duration: '1-2 год',
      photosCount: '60-70 фото',
      deliveryTime: 'до 14 днів',
    },
    description:
      'Це фотосесія для компанії від 3 до 7 осіб — друзів, родини, колег або будь-якої невеликої групи.\nМета — зберегти ваші спільні емоції, взаємодію та унікальні моменти разом.\nЗйомка проходить у розслабленій і природній атмосфері, де кожен може почуватися комфортно і впевнено.\nПід час фотосесії я допомагаю з позуванням і створюю легкі, живі кадри, які розповідають вашу історію через усмішки, дотики і спільні моменти.\nГрупова зйомка — чудовий спосіб зафіксувати важливі події, дружбу чи родинні зв’язки, створити теплі спогади, які будуть гріти серце довгі роки.',
  },
};

export default serviceDetails;
