const terms = [
  {
    title: 'Термін віддачі фото',
    subtitle: 'До 10 днів (в обробці — тільки найкращі кадри\nв моєму авторському стилі).',
  },
  {
    title: ' Термінова обробка (до 24 годин)',
    subtitle: '500 грн до обраного тарифу\nДоступна тільки за попередньою домовленістю.',
  },
  {
    title: ' Виїзд за місто',
    subtitle:
      'Зйомка за межами міста (де не курсує громадський транспорт)\nлише за умови організації або компенсації трансферу.',
  },
  {
    title: 'У вартість не входить:',
    subtitle:
      '— оренда студії\n— послуги візажиста, стиліста, перукаря\nАле за потреби — порекомендую перевірених майстрів,\nз якими я працюю',
  },
  {
    title: 'Питання — це нормально!',
    subtitle:
      'Я завжди зацікавлена в тому, щоб результат вийшов не просто\nкрасивим, а твоїм.\nТому не соромся питати про локації, образи, настрій\nчи саму ідею фотосесії — я з радістю допоможу!',
  },
];

export default terms;
